[
    {
  "title": "Supreme Court Rejects Partition Suit Filed 45 Years After Property Sale",
  "description": "<p>The Supreme Court recently dismissed a partition suit that was initiated a staggering 45 years after the property's sale deed was registered. The Court emphasized that the registration of a sale deed serves as a public notice, implying that any party with an interest in the property is presumed to be aware of such transactions from the date of registration. This means that the limitation period for filing claims starts from that moment. In this particular case, the plaintiffs' prolonged inaction—spanning over four decades—was deemed unacceptable. The Court reiterated that, according to the law, any claims or disputes regarding property transactions should be raised within the prescribed limitation period, which, in this context, had long expired. This ruling serves as a stark reminder of the importance of timely legal action in property disputes and the weight that registered documents carry as public notices.</p>",
  "image": "https://i.ibb.co/jZbQMctf/Supreme-Court-Rejects-Partition-Suit-Filed-45-Years-After-Property-Sale.png"
    },
    {
      "title": "Healthy Living Tips",
      "description": "<p>Maintaining a healthy lifestyle is essential. Eat <strong>nutritious food</strong>, exercise regularly, and get enough sleep. <br> <a href='https://healthylife.com'>Explore tips</a>.</p>",
      "image": "https://i.ibb.co/gLk9c0Tc/Affnarayani-Logo.jpg"
    },
    {
      "title": "Top 10 Travel Destinations",
      "description": "<p>Want to explore the world? Here are the <strong>top 10 travel destinations</strong> for 2025. Visit <a href='https://travelguide.com'>Travel Guide</a> for details.</p>",
      "image": "https://i.ibb.co/gLk9c0Tc/Affnarayani-Logo.jpg"
    },
    {
      "title": "Top 20 Bhootiya Destinations",
      "description": "<p>Want to explore the bhoot? Here are the <strong>top 10 bhootiya destinations</strong> for 2025. Visit <a href='https://travelguide.com'>Travel Guide</a> for details.</p>",
      "image": "https://i.ibb.co/Dg4sMh1n/images.png"
    }
]
